{
  "header": {
    "contact": "Contact",
    "mywork": "My Projects",
    "skills": "Skills",
    "whyme": "Why Me",
    "job": "Fullstack Developer"
  },
  "footer": {
    "imprint": "Imprint",
    "privacy": "Privacy policy"
  },
  "whyme": {
    "header": "Why Me",
    "secondaryheader": "I am",
    "location": "located in ",
    "descripeme": "I am a patient and persistent fullstack developer. With my detail-orientation and willingness to learn, I always work to develop clean and well thought-out solutions. I see new technologies and challenges as an opportunity to develop myself further and create added value, both for projects and for my team.",
    "button": "Contact me",
    "remote": "open to remote work"
  },
  "myskills": {
    "header": "My Skill Set",
    "intro": "The IT landscape is continuously evolving, with new technologies and methodologies. Staying motivated to expand my IT skills requires a strategic approach, a curious mindset, and a commitment to lifelong learning",
    "challange": "I am always happy to learn new technologies, just tell me what you need."
  },
  "mywork": {
    "subhead": "Project ",
    "about": "About the project",
    "usedtechnick": "Technologies I have used",
    "learned": "What i have learned",
    "Join": {
      "learned": "The first steps in Angular, how can I manipulate dom and how do I get my own database from Firebase Synchron , so that you can play a common game over the Internet.",
      "about": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories."
    },
    "Ringoffire": {
      "learned": "The first steps in Angular, how can I manipulate dom and how do I get my own database from Firebase Synchron , so that you can play a common game over the Internet.",
      "about": "A realisation of the game Ring of Fire, connected to a Firebase database, so that it is possible to share the same data set with several players over the Internet and keep it up to date."
    },
    "Sharky": {
      "learned": "Object orientated programming, creating classes and integrating them into a canvas, how do I bind and use prefabricated models and how do I keep an overview.",
      "about": "Little Sharky is a small browser game, there are a total of two different levels, easy and hard (dark and light). You have to defeat or avoid enemies with the little shark, collect poison bottles and defeat a killer whale at the end."
    },
    "Pokedex": {
      "learned": "Utilisation and orientation in an unknown API, how do I access it and where do I find the data I want to use?",
      "about": "My own Pokedex to retrieve information about different Pokemon. You can also view more detailed data on individual Pokemon, e.g. which attacks they can learn."
    },
    "nextWork": "I am currently working with a small group on a project called ‘Münster Interessierts / Policast’. The team came together at MSHack 2024 and is currently being supported by the Solution Enabler programme. I am supporting the frontend area. The aim is to produce an audible weekly summary from the City of Münster's Council Information Network using LLM, ideally as a podcast. ",
    "btn": "Let's Talk",
    "showmore": "Show me more",
    "showless": "Show me less"
  },
  "references": {
    "header": "References",
    "firstcomment": "Toni is characterized by his pronounced determination. With his adaptable nature, he always finds constructive solutions to continue on the path he has chosen and achieve the agreed goals, even when faced with challenges. These qualities make him a great asset to the entire team.",
    "secondcomment": "Toni was an asset to the team as he always had an overview of the project and was able to solve problems in a targeted manner. In addition, he was always a good and helpful contact person and has a focused and effective way of thinking.",
    "thirdcomment": "Toni is friendly, helpful and provided excellent support to the team during the project. He always had a solution at hand and stood out for his determination when it came to completing projects quickly and efficiently. Without his commitment, it would have taken us much longer to complete the project.",
    "project": "Project Join",
    "buddy": "Coding buddy"
  },
  "contact": {
    "header": "Contact me",
    "input": {
      "name": {
        "default": "Your name",
        "wrong": "Please enter your Name.",
        "label": "A name with minimum of 3 letters."
      },
      "mail": {
        "default": "Your e-mail",
        "wrong": "Please fill a mail adress. example: max@aol.com",
        "label": "E-mail format example: max@aol.com"
      },
      "message": {
        "default": "Your message",
        "wrong": "Please send me some Words , not a empty mail.",
        "label": "Minimum of 4 letters for Hello, please."
      },
      "readpolicity": {
        "1": "I've read the",
        "2": "and agree to the processing of my data as outlined."
      }
    },
    "button": "Send",
    "subheader": "Let us work together.",
    "letsWorkTogetherText": "Whether your project involves developing a new application, updating existing systems or migrating to a new framework, I have the technical expertise to make it a success.",
    "sendmail":"Thank's for your message."
  },
  "tooltips": {
    "start":"Start exploring.",
    "arrowNext": "Jump to next section.",
    "arrowBack": "Jump back to start.",
    "sendMail": "Send me mail with system mail program.",
    "visitGitHub": "Visit my GitHub site.",
    "visitlinkIn": "Visit my LinkIn.",
    "changeLang": "Change the language.",
    "visitGitProject": "Visit the GitHub project.",
    "try": "Try the project.",
    "contact": "Jump to contact formular."
  },
  "impres": {
    "country": "Germany",
    "phone": "Telephone: Contact me first via mail if you want call me.",
    "create": "I myself am responsible for the content.",
    "private": "This is a private website that is operated exclusively for non-commercial purposes."
  },
  "privacy": {
    "owner": "Responsible person",
    "purpose": {
      "header": "Purpose of data processing",
      "content": "The data entered in the contact form (name, e-mail, message) will only be used to process your enquiry."
    },
    "legalhead": {
      "header": "Legal basis for the processing of data",
      "content": "Processing is generally carried out on the basis of Art. 6 para. 1 lit. b DSGVO (fulfilment of contract) or Art. 6 para. 1 lit. f DSGVO (legitimate interest)."
    },
    "storage": {
      "header": "Storage duration",
      "content": "The data collected will be deleted as soon as it is no longer required for the original purpose."
    },
    "thirdparty": {
      "header": "Transfer of data to third parties",
      "part1": "The data processed via this website is forwarded to my hosting service provider Strato AG, as this website is hosted on their servers. In addition, I use the e-mail hosting services of Strato AG to receive and manage the messages you send via the contact form or by e-mail.",
      "part2": "Strato AG is a company based in Germany and is subject to the provisions of the General Data Protection Regulation (DSGVO). Strato AG processes your personal data exclusively within the framework of an order processing contract in accordance with Art. 28 DSGVO, which I have concluded with Strato.",
      "part3": "Further information on data processing by Strato can be found in Strato's privacy policy:",
      "part4": "Your data will not be passed on to third parties beyond this unless I are legally obliged to do so or you have expressly consented to this."
    },
    "userrights": {
      "header": "Rights of the users",
      "point1": "Information about stored data (Art. 15 DSGVO)",
      "point2": "Correction of incorrect data (Art. 16 DSGVO)",
      "point3": "Deletion of the data (Art. 17 DSGVO)",
      "point4": "Restriction of processing (Art. 18 DSGVO)",
      "point5": "Data portability (Art. 20 DSGVO)",
      "point6": "Objection to the processing (Art. 21 DSGVO)"
    },
    "contactoption": "Contact option for data protection requests",
    "external": {
      "header": "Links to external services and websites",
      "part1": "This website contains links to external services and websites. When you click on these links, you will be redirected to the website of the respective provider. Please note that these external websites have their own data protection regulations, over which I have no influence.",
      "subhead": "The external services to which I link are",
      "li1": "GitHub is a platform for the development and management of software projects. Provider: GitHub, Inc, 88 Colin P Kelly Jr St, San Francisco, CA 94107, USA. Further information can be found in GitHub's privacy policy:",
      "li2": "LinkedIn is a social network that provides professional contacts and content. Provider: LinkedIn Corporation, 1000 W. Maude Avenue, Sunnyvale, CA 94085, USA (for users outside the EU: LinkedIn Ireland Unlimited Company, Wilton Plaza, Wilton Place, Dublin 2, Ireland). Further information can be found in LinkedIn's privacy policy:",
      "li3": "I use Strato both as a hosting service provider and for my e-mail service. Further information can be found in Strato's privacy policy:",
      "part2": "Please note that by clicking on external links, personal data (e.g. your IP address) may be transmitted to the respective platform."
    }
  }
}
